ГТС/УТГТС/Documents/ЗаявкаНаТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаТранспорт</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаТранспорт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучаемыхНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаЧейСчетДоставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаЧейСчетДоставка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПлательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаСчетКомпании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКартойДистанционная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийВнутр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзятоВРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСклад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыЗаЧейСчетДоставка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыЗаЧейСчетДоставка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетПодразделения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаявокНаТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаТранспорт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Documents/ЗаявкаНаТранспорт/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьРеквизитЭлементаСервер(Элемент,ИмяРеквизита)
	Возврат Элемент[ИмяРеквизита];
КонецФункции

&НаСервере
Процедура РассчитатьВесНаСервере()
	СтрокаТЧ = Объект.Товары[Элементы.Товары.ТекущаяСтрока];
	Вес = СтрокаТЧ.Номенклатура.ВесЧислитель/?(СтрокаТЧ.Номенклатура.ВесЗнаменатель=0, 1, СтрокаТЧ.Номенклатура.ВесЗнаменатель);
	Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
		Вес = СтрокаТЧ.Упаковка.Вес;
	КонецЕсли;	
	СтрокаТЧ.Вес = СтрокаТЧ.Количество * Вес;
	
КонецПроцедуры//РассчитатьВесСервер	

&НаСервере
Процедура РассчитатьОбъемНаСервере() 
	
	СтрокаТЧ = Объект.Товары[Элементы.Товары.ТекущаяСтрока];
	Объем = 0;
	Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
		Объем = СтрокаТЧ.Упаковка.Объем;
	Иначе
		Объем = СтрокаТЧ.Номенклатура.ОбъемЧислитель/?(СтрокаТЧ.Номенклатура.ОбъемЗнаменатель=0, 1, СтрокаТЧ.Номенклатура.ОбъемЗнаменатель);
	КонецЕсли;	
	Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
		Объем = СтрокаТЧ.Упаковка.Объем;
	КонецЕсли;
	СтрокаТЧ.Объем = СтрокаТЧ.Количество * Объем;
	
КонецПроцедуры	//РассчитатьОбъемСервер

&НаСервере
Процедура АвтомобильПриИзмененииСервер()
	Объект.Водитель = Объект.Автомобиль.Водитель;
КонецПроцедуры//АвтомобильПриИзмененииСервер()	

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере()
	
	об = Объект.Ссылка.ПолучитьОбъект();
	об.Товары.Очистить();
	об.Заполнить(Объект.ДокументОснование);
	об.Записать(РежимЗаписиДокумента.Запись);
	ЭтаФорма.Прочитать();
	
КонецПроцедуры//ЗаполнитьПоОснованиюНаСервере()	

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	//Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	Элементы.Сумма.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") И Права()=Ложь;
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
		Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Ложь;
	КонецЕсли;
	Если Объект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента И Права()=Ложь Тогда
		Элементы.ПодразделениеПлательщик.ТолькоПросмотр=Истина;
		Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Истина; 
	КонецЕсли;
	Если Объект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетПодразделения И Права()=Ложь Тогда
	Элементы.ВариантЗаЧейСчетДоставка.ТолькоПросмотр=Истина;
	Элементы.ПодразделениеПлательщик.ТолькоПросмотр=Истина;
	Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Истина;
	КонецЕсли;
		
	Если Права() Тогда
	Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Ложь;
	Элементы.Сумма.ТолькоПросмотр=Ложь;
	КонецЕсли;
	
	Элементы.ГруппаОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаТранспортПрисоединенныеФайлы.Ссылка) КАК ЧислоФайлов,
		|	ЗаявкаНаТранспортПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ЗаявкаНаТранспортПрисоединенныеФайлы КАК ЗаявкаНаТранспортПрисоединенныеФайлы
		|ГДЕ
		|	ЗаявкаНаТранспортПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И ЗаявкаНаТранспортПрисоединенныеФайлы.ПометкаУдаления = &ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаТранспортПрисоединенныеФайлы.ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПометкаУдаления", ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ФайловВложено=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФайловВложено=ВыборкаДетальныеЗаписи.ЧислоФайлов;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА      
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);


	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	АвтомобильПриИзмененииСервер();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТЧ ТОВАРЫ

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	РассчитатьВесНаСервере();
	РассчитатьОбъемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ОбработкаТабличнойЧастиТоварыКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	РассчитатьВесНаСервере();
	РассчитатьОбъемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	РассчитатьВесНаСервере();
	РассчитатьОбъемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	ЗаполнитьПоОснованиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиПриИзменении(Элемент)
	Если 
		Объект.ОплатаНаличными=ИСТИНА Тогда
		попытка
		ОплатаНалСервер();
		исключение
		конецпопытки;
	ИНАЧЕ  
		Объект.СуммаПолучаемыхНаличных=0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОплатаНалСервер()
Объект.СуммаПолучаемыхНаличных=Объект.ДокументОснование.СуммаДокумента;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ГТС ограничиваем статус к выполнению если нет резерва или отгрузки
	
	Если Объект.Статус=Перечисления.СтатусыЗаявокНаТранспорт.КВыполнению 
	И ТипЗнч(Объект.ДокументОснование)=Тип("ДокументСсылка.ЗаказКлиента")
		Тогда
		            		
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	ЗаказКлиентаТовары.Номенклатура,
			//	|	ЗаказКлиентаТовары.Количество КАК Количество,
			//	|	ЗаказКлиента.Склад,
			//	|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
			//	|	ЗаказКлиентаТовары.Характеристика
			//	|ИЗ
			//	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
			//	|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка
			//	|ГДЕ
			//	|	ЗаказКлиента.Ссылка = &Ссылка";
			//
			//Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
			//
			//РезультатЗапроса = Запрос.Выполнить();
			//
			//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	Если 
			//		//Число(ВыборкаДетальныеЗаписи.Количество) <= Число(ВыборкаДетальныеЗаписи.ВНаличииОстаток) ИЛИ 
			//		ВыборкаДетальныеЗаписи.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить ИЛИ ВыборкаДетальныеЗаписи.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада ИЛИ ВыборкаДетальныеЗаписи.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно 
			//		или 
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Ермилова Елена") или 
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Марченко Наталья Анатольевна") или 
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Макухин Николай Владимирович") или 
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Федосова Анна Викторовна") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Селезнев Андрей") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Шадрин Игорь Сергеевич") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Юдичев Алексей Сергеевич") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Трубаев Николай") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Лакирев Александр") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Комяков Борис") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Крайнев Сергей Анатольевич") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Воротилов Александр Юрьевич") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Андрианов Дмитрий Николаевич") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Ласкеев Павел") или
			//		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Вирзин Дмитрий") или
			//		Пользователи.ТекущийПользователь() = Справочники.Пользователи.НайтиПоНаименованию("Гришин Даниил") или  
			//		Пользователи.ТекущийПользователь() = Справочники.Пользователи.НайтиПоНаименованию("Пазухин Даниил Алексеевич") или
			//		Пользователи.ТекущийПользователь() = Справочники.Пользователи.НайтиПоНаименованию("Свинухов Тимур Александрович")
			//        или
			//		Объект.ВзятоВРаботу=истина
			//		Тогда Продолжить;
			//	ИначеЕсли ВыборкаДетальныеЗаписи.Номенклатура.ТипНоменклатуры=Перечисления.ТипыНоменклатуры.Товар Тогда
			//		Сообщить ("Товар " + ВыборкаДетальныеЗаписи.Номенклатура + " не зарезервирован и не отгружен. Установить доставку 'К выполнению' можно только после резервирования товара на складе");
			//		Отказ=Истина;
			//	Иначе Продолжить;
			//	КонецЕсли;
			//	
			//КонецЦикла;
	
	
КонецЕсли;
//ГТС проверка заполнения на новые поля
Если ТекущийОбъект.Дата>'20200801' Тогда
Если (ТекущийОбъект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетПодразделения И НЕ значениезаполнено(ТекущийОбъект.ПодразделениеПлательщик)) 
	ИЛИ  (ТекущийОбъект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетПодразделения И не значениезаполнено(ТекущийОбъект.СуммаЗаСчетКомпании))
	//ИЛИ (ТекущийОбъект.Сумма=0 И ТекущийОбъект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента)
	ИЛИ НЕ ЗначениеЗаполнено(ТекущийОбъект.ВариантЗаЧейСчетДоставка)
	ИЛИ ( значениезаполнено(ТекущийОбъект.СуммаЗаСчетКомпании) И ТекущийОбъект.ВариантЗаЧейСчетДоставка<>Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетПодразделения )
	Тогда
	  сообщить("Требуется указать подразделение-плательщик и сумму оплаты");
	  Отказ=Истина;
  КонецЕсли;
КонецЕсли;

	Если ТекущийОбъект.Дата>'20220717' И ТекущийОбъект.Маркетплейс=Истина и НЕ ЗначениеЗаполнено(ТекущийОбъект.ПолучательФИО) Тогда
		Сообщить ("Для доставок через маркетплейс требуется указать ФИО получателя, чей документ будет предъявлен при доставке");
		Отказ=Истина;
	КонецЕсли;


ТекущийОбъект.Вес=Объект.Товары.Итог("Вес");
ТекущийОбъект.Объем=Объект.Товары.Итог("Объем"); 

//ГТС проставляем статус в заказе клиента
Если ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) И ТипЗнч(ТекущийОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
	Если ТекущийОбъект.Статус=Перечисления.СтатусыЗаявокНаТранспорт.Выполнено И ТекущийОбъект.ДокументОснование.ЗаявкаНаТранспортВыполнена=Ложь Тогда
		ЗаказК=ТекущийОбъект.ДокументОснование.ПолучитьОбъект();
		ЗаказК.ЗаявкаНаТранспортВыполнена=Истина;      
		ЗаказК.Записать();
	КонецЕсли;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ФайловВложеноНажатие(Элемент, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  Объект.Ссылка); 
	//ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
	             ПараметрыФормы,
	            // ПараметрыВыполненияКоманды.Источник,
	            // ПараметрыВыполненияКоманды.Уникальность,
	            // ПараметрыВыполненияКоманды.Окно
				);
КонецПроцедуры


&НаСервере
Процедура ПодразделениеПлательщикПриИзмененииНаСервере()
если Права()=Ложь Тогда
Объект.ПодразделениеПлательщик=Пользователи.ТекущийПользователь().Подразделение;
Иначе
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПлательщикПриИзменении(Элемент)
ПодразделениеПлательщикПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВариантЗаЧейСчетДоставкаПриИзмененииНаСервере()
ТекущийПользователь=Пользователи.ТекущийПользователь();       
Если Объект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента Тогда
Элементы.ПодразделениеПлательщик.ТолькоПросмотр=Истина;
Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Истина;
//ИначеЕсли Объект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента и Объект.Сумма=0 Тогда
//сообщить("В заявке на транспорт не указана стоимость доставки, укажите за счет какого подразделения доставка и сумму");
//Объект.ПодразделениеПлательщик=ТекущийПользователь.Подразделение;
//Объект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетПодразделения;
//Элементы.ПодразделениеПлательщик.ТолькоПросмотр=Ложь;
//Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=НЕ Параметры.Ключ.Пустая();
//ИначеЕсли Объект.ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента Тогда
//Элементы.ПодразделениеПлательщик.ТолькоПросмотр=Истина;
//Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Истина;
Объект.ПодразделениеПлательщик=неопределено;
Объект.СуммаЗаСчетКомпании=неопределено;
Иначе
Объект.ПодразделениеПлательщик=ТекущийПользователь.Подразделение;
Элементы.ПодразделениеПлательщик.ТолькоПросмотр=Ложь;
Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=НЕ Параметры.Ключ.Пустая();
КонецЕсли;                         
Если Права()=Истина Тогда
Элементы.СуммаЗаСчетКомпании.ТолькоПросмотр=Ложь;
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВариантЗаЧейСчетДоставкаПриИзменении(Элемент)
	ВариантЗаЧейСчетДоставкаПриИзмененииНаСервере();
КонецПроцедуры

Функция Права()
	Если Пользователи.ТекущийПользователь()=Справочники.Пользователи.НайтиПоНаименованию("Комяков Борис") или
		Пользователи.ТекущийПользователь()=Справочники.Пользователи.НайтиПоНаименованию("Вирзин Дмитрий") или
		Пользователи.ТекущийПользователь()=Справочники.Пользователи.НайтиПоНаименованию("Крайнев Сергей Анатольевич") или
		Пользователи.ТекущийПользователь()=Справочники.Пользователи.НайтиПоНаименованию("Воротилов Александр Юрьевич") или
		Пользователи.ТекущийПользователь() = Справочники.Пользователи.НайтиПоНаименованию("Андрианов Дмитрий Николаевич") или
		Пользователи.ТекущийПользователь() = Справочники.Пользователи.НайтиПоНаименованию("Гришин Даниил")  или
		Пользователи.ТекущийПользователь() = Справочники.Пользователи.НайтиПоНаименованию("Пазухин Даниил Алексеевич")
		Тогда
	Возврат Истина;
	Иначе Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ТелефонКлиентаПриИзменении(Элемент)
	ТекСтрокаИсходная		=	Объект.ТелефонКлиента;
		    ТекСтрокаТолькоЦифры	=	"";
			//если Лев(ТекСтрокаИсходная, 2) = "+7" тогда 
			//ТекСтрокаИсходная = "8"+Сред(ТекСтрокаИсходная,3);
			//конецесли;
		    Для ТекНомерСимвола = 1 По СтрДлина(ТекСтрокаИсходная) Цикл
			ТекСимвол	=	Сред(ТекСтрокаИсходная, ТекНомерСимвола, 1);
		    Если	Найти("0123456789;,", ТекСимвол) > 0	Тогда
			ТекСтрокаТолькоЦифры	=	ТекСтрокаТолькоЦифры	+	ТекСимвол;
			КонецЕсли;
		    КонецЦикла;
			Если СтрДлина(ТекСтрокаТолькоЦифры) = 10 Тогда
          	 ТекСтрокаТолькоЦифры = "+7" + ТекСтрокаТолькоЦифры;
     		КонецЕсли;
      		Если СтрДлина(ТекСтрокаТолькоЦифры) = 11 И Лев(ТекСтрокаТолькоЦифры, 1) = "8" ИЛИ Лев(ТекСтрокаТолькоЦифры, 1) = "7" Тогда
            ТекСтрокаТолькоЦифры = "+7" + Сред(ТекСтрокаТолькоЦифры,2);
		КонецЕсли;
		Объект.ТелефонКлиента= ТекСтрокаТолькоЦифры;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьВесНаСервере();
	РассчитатьОбъемНаСервере();
КонецПроцедуры
